# -*- coding: utf-8 -*-
"""
Created on Thu Feb 19 01:55:15 2026

@author: yoshikazu.nojiri
"""
# コピペしたら練習にならないので、直打ちすること！

############################
# 1
############################
"""
# リストの生成
a = [1,2,3,4]

print( a )
"""
############################
# 2
############################
"""
# 5～100までのリストの生成
# a = list(range(5, 101))
#a = list(range(101))

#print( a )
"""
############################
# 3
############################
"""
# [0.5, 0.6, 0.7, ..., 10.0]というリストの生成
a = [i/10.0 for i in range(5,101)]

print( a )
"""
############################
# 4
############################
"""
# リストの要素数
#a = list(range(546))

#print( len(a) )
"""
############################
# 5
############################
"""
# 2つのリストの連結
#a = list(range(10))
#b = list(range(10, 20))
#c = a + b

#print( c )
"""
############################
# 6
############################
"""
# 名前のリスト["Taro", "Hanako", "Jiro"]と，テストの点数のリスト[95, 80, 90]がある時，
# 要素を連結したリスト[("Taro", 95), ("Hanako", 80), ("Jiro", 90)]の生成
#names = ["Taro","Hanako","Jiro"]
#points = [95, 80, 90]
#pairs = list(zip(names, points)) 

#print( pairs )   
"""
############################
# 7
############################
"""
# [("Taro", 95), ("Hanako", 80), ("Jiro", 90)]の要素をfor文で一つづつ表示
# ()のことをタプルという
names = ["Taro", "Hanako", "Jiro"] 
points = [95, 80, 90]
pairs = zip(names, points)

#print(list(pairs))

# forの後の変数は、pairsを一つづつ取り出し、タプルの要素を変数に入れる
# タプルの要素数の変数が定義されていないとエラーになる
for name, point in pairs:
    print("Name", name)
    print("Point", point)
    print("-------")
    
"""
############################
# 8
############################
"""
# 適当なリストの50番目以降の値を取り出す
a = list(range(125,250))
b = a[50:]

print( b )
"""
############################
# 9
############################
"""
#  適当なリストから50番目以降の6個の値を取り出す
a = list(range(125,250))
b = a[50:56]

print( b )
"""
############################
# 10
############################
"""
#  適当なリストから50番目以降の値を7つ置きに値を取り出す
a = list(range(125,250))
b = a[50::7]

print( b )
"""
############################
# 11
############################
"""
# [0, 1, 2, ..., 99]のリストを順序を逆にする
a = list(range(0,100))
b = a[::-1]

print( b )
"""
############################
# 12
############################
# リストの後ろから3つ目の要素を取り出す
#a = [5,7,1,3,2]
a= list(range(0,10000))
b = a[-3]

print( b )













    
    
    
    