# -*- coding: utf-8 -*-
"""
Created on Thu Feb 26 16:04:37 2026

@author: yoshikazu.nojiri
"""

# コピペしたら練習にならないので、直打ちすること！

############################
# 1
############################
"""
# 文字列の連結
a = "abc"
b = "def"
c = a + b

print( c )
"""
############################
# 2
############################
"""
# 文字の置換
a = "he**o wor*d"
b = a.replace("*","l")

print( b )
"""
############################
# 3
############################
"""
# 数値を文字列，文字列を数値に変換
a = str(100)
b = int(a)

print( type(a) )
print( type(b) )
"""
############################
# 4
############################
"""
# 　特定の文字の削除
a = "h*e*l*l*o ****wor**l**d"
b = a.replace("*", "")

print( b )
"""
############################
# 5
############################
"""
#  単語分割 / 文字列にしかできない
a = "I am Yoshikazu"
b = a.split(" ")

b = a.split( )

print( b )
"""
############################
# 6
############################
"""
# リストに入っている文字列をスペース区切りで連結
a = ["I", "am", "Yoshikazu"]
c = " ".join(a)

print( c )
"""
############################
# 7
############################
"""
# リストに入っている文字列をカンマ（","）区切りで連結
a = ["I", "am", "Yoshikazu"]
c = ",".join(a)

print( c )
"""
############################
# 8
############################
"""
# "hweolrllod"から1文字置きに文字を取り出す
a = "hweolrllod"
c = a[::2]

print( c )
"""
############################
# 9
############################
"""
# "olleh"を逆順する
a = "olleh"
b = a[::-1]

print( b )
"""
############################
# 10
############################
"""
# 3ケタの数値文字列のリスト["No. 000","No. 001", ..., "No. 010"]を生成
a = ["No. %03d" % i for i in range(11)]

print( a ) 
""" 
############################
# 11
############################
# 少数の数値文字列のリスト["No. 0.00","No. 0.01", ..., "No. 01.0"]を生成
a = ["No. %f" % (i/10.0) for i in range(11)]

print( a )





